app/Controllers/Aspirante.php

SELECT *
FROM `aspirantes`
WHERE `curp` = 'AUCY021231HOCQHHA0'
 LIMIT 1
SELECT *
FROM `users`
WHERE `username` = 'AUCY021231HOCQHHA0'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `documentos`
WHERE `activo` = 1
---
    public function obtenerAvanceAspirante($curp)
    {
        $aspiranteModel = new \App\Models\AspiranteModel();
        $userModel = new \CodeIgniter\Shield\Models\UserModel();
        $respuestasModel = new \App\Models\RespuestasModel();
        $prefichasModel = new \App\Models\PrefichasModel();
        $documentosModel = new \App\Models\DocumentosModel();
        $documentosAspiranteModel = new \App\Models\DocumentosAspirantesModel();

        // Paso 1: Registro
        $aspirante = $aspiranteModel->where('curp', $curp)->first();
        $registro = $aspirante ? true : false;

        // Paso 2: Usuario creado en sistema
        $usuario = $userModel->where('username', $curp)->first();
        $usuarioCreado = $usuario ? true : false;

        // Paso 3: Encuesta contestada
        $respuestas = $respuestasModel->where('aspirante_curp', $curp)->countAllResults();
        $encuestaContestada = $respuestas > 0;

        // Paso 4: Pago realizado (campo preficha en tabla aspirantes, 1=pagado, 0=no pagado)
        $pagoRealizado = ($aspirante && isset($aspirante['preficha']) && $aspirante['preficha'] == 1);

        // Paso 5: Preficha generada por el instituto
        $preficha = $prefichasModel->where('curp', $curp)->first();
        $prefichaGenerada = $preficha ? true : false;

        // Documentos necesarios
        $documentosNecesarios = $documentosModel->where('activo', 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `aspirante_grupo_examen`
WHERE `curp` = 'AUCY021231HOCQHHA0'
---
        $documentacionAprobada = ($documentosAprobados == $documentosNecesarios && $documentosNecesarios > 0);
        // Paso extra: Grupo de examen asignado (si existe el curp en la tabla aspirante_grupo_examen)
        $db = \Config\Database::connect();
        $grupoExamenAsignado = $db->table('aspirante_grupo_examen')->where('curp', $curp)->countAllResults() > 0;

SELECT `aspirantes`.*, `sedes`.`nombre_sede` as `sede_nombre`, `carreras`.`nombre` as `carrera_nombre`
FROM `aspirantes`
JOIN `sedes` ON `sedes`.`id_sede` = `aspirantes`.`sede`
JOIN `carreras` ON `carreras`.`id` = `aspirantes`.`carrera`
WHERE `aspirantes`.`curp` = 'AUCY021231HOCQHHA0'
 LIMIT 1
---
    public function infoAspirante()
    {
        // Obtener el usuario autenticado
        $user = auth()->user();
        if (!$user) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'Debes iniciar sesión.');
        }

        // El username es el CURP
        $curp = $user->username;

        // Buscar al aspirante por CURP
        $aspiranteModel = new \App\Models\AspiranteModel();
        $aspirante = $aspiranteModel
            ->select('aspirantes.*, sedes.nombre_sede as sede_nombre, carreras.nombre as carrera_nombre')
            ->join('sedes', 'sedes.id_sede = aspirantes.sede')
            ->join('carreras', 'carreras.id = aspirantes.carrera')
            ->where('aspirantes.curp', $curp)
            ->first();