app/Controllers/Aulas.php

SELECT *
FROM `aulas`
WHERE `sede_id` = '2'
AND `disponible` = 1
---
public function getAulasPorSede($sedeId)
{
    if (!auth()->loggedIn() || !in_array(auth()->user()->nivel, [0, 1])) {
        return $this->response->setStatusCode(403)->setJSON(['error' => 'No autorizado']);
    }

    $aulaModel = new \App\Models\AulasModel();
    $aulas = $aulaModel->where('sede_id', $sedeId)->where('disponible', 1)->findAll();