app/Controllers/Convocatoria.php

    public function getFechasConvocatoria($codigo)
    {
        $convModel = new \App\Models\ConvocatoriaModel();
        $conv = $convModel->where('codigo', $codigo)->first();
---
SELECT *
FROM `convocatorias`
WHERE `codigo` = 'AGO25-DIC25'
 LIMIT 1