app/Controllers/Convocatoria.php

public function getFechasConvocatoria($id)
{
    $convModel = new \App\Models\ConvocatoriaModel();
    $conv = $convModel->where('codigo', $id)->first();
---
SELECT *
FROM `convocatorias`
WHERE `codigo` = 'AGO25-DIC25'
 LIMIT 1