app/Controllers/Documentacion.php

SELECT DISTINCT `aspirante_curp`
FROM `documentos_aspirante`
SELECT *
FROM `aspirantes`
WHERE `curp` IN ('AUCY021231HOCQHHA0')
---
public function indexAdmin()
{
    if (auth()->loggedIn()) {
        $user = auth()->user();

        if (!in_array($user->nivel, [0, 1])) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'No tienes permiso para acceder a esta sección.');
        }

        // Obtener aspirantes con al menos un documento subido
        $documentosAspiranteModel = new \App\Models\DocumentosAspirantesModel();
        $curps = $documentosAspiranteModel
            ->select('aspirante_curp')
            ->distinct()
            ->findAll();

        $curpList = array_column($curps, 'aspirante_curp');

        $aspiranteModel = new \App\Models\AspiranteModel();
        $aspirantes = !empty($curpList)
            ? $aspiranteModel->whereIn('curp', $curpList)->findAll()

SELECT *
FROM `aspirantes`
WHERE `curp` = 'AUCY021231HOCQHHA0'
 LIMIT 1
SELECT *
FROM `documentos`
WHERE `activo` = 1
SELECT *
FROM `documentos_aspirante`
WHERE `aspirante_curp` = 'AUCY021231HOCQHHA0'
---
  public function ver($curp)
    {
        if (!auth()->loggedIn()) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'Debes iniciar sesión.');
        }

        $user = auth()->user();
        if (!in_array($user->nivel, [0, 1])) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'Acceso no autorizado.');
        }

        // Obtener aspirante
        $aspiranteModel = new AspiranteModel();
        $aspirante = $aspiranteModel->where('curp', $curp)->first();

        if (!$aspirante) {
            return redirect()->back()->with('error', 'Aspirante no encontrado.');
        }

        // Obtener documentos disponibles
        $documentoModel = new DocumentosModel();
        $documentos = $documentoModel->where('activo', 1)->findAll();

        // Obtener documentos subidos por el aspirante
        $documentosAspiranteModel = new DocumentosAspirantesModel();
        $documentosSubidos = $documentosAspiranteModel->where('aspirante_curp', $curp)->findAll();

SELECT *
FROM `documentos_aspirante`
WHERE `documentos_aspirante`.`id` = '7'
UPDATE `documentos_aspirante` SET `estatus` = '1', `observaciones` = 'LAS FIRMAS NO SON LEGIBLES O NO SE ENCUENTRAN EN EL DOCUMENTO. La firmas deben ser en tinta azul.'
WHERE `documentos_aspirante`.`id` IN ('7')
---
    public function actualizar()
    {
        if (!auth()->loggedIn()) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'Debes iniciar sesión.');
        }

        $id = $this->request->getPost('documento_aspirante_id');
        $estatus = $this->request->getPost('estatus');
        $observaciones = $this->request->getPost('observaciones');

        $model = new DocumentosAspirantesModel();
        $documento = $model->find($id);

        if (!$documento) {
            return redirect()->back()->with('error', 'Documento no encontrado.');
        }

        $model->update($id, [
            'estatus' => $estatus,
            'observaciones' => $observaciones,
        ]);