app/Controllers/Encuesta.php

SELECT `aspirantes`.*, `carreras`.`nombre` as `nombre_carrera`, `sedes`.`nombre_sede`
FROM `aspirantes`
JOIN `carreras` ON `carreras`.`id` = `aspirantes`.`carrera`
JOIN `sedes` ON `sedes`.`id_sede` = `aspirantes`.`sede`
WHERE `aspirantes`.`curp` = 'AUCY021231HOCQHHA0'
 LIMIT 1
---
    public function obtenerPreficha()
    {
        if (!auth()->loggedIn()) {
            return redirect()->to(site_url('Acceso/login'));
        }

        $user = auth()->user();
        $curp = $user->username;

        // Obtener datos del aspirante
        $aspiranteModel = new \App\Models\AspiranteModel();
        $aspirante = $aspiranteModel
            ->select('aspirantes.*, carreras.nombre as nombre_carrera, sedes.nombre_sede')
            ->join('carreras', 'carreras.id = aspirantes.carrera')
            ->join('sedes', 'sedes.id_sede = aspirantes.sede')
            ->where('aspirantes.curp', $curp)
            ->first();