app/Controllers/GruposExamen.php

SELECT *
FROM `aulas`
WHERE `tipo` = 3
---
            'user_info' => datos_usuario(),
            'sedes' => (new \App\Models\SedesModel())->findAll(),
            'carreras' => (new \App\Models\CarrerasModel())->findAll(),
            'aulas' => (new \App\Models\AulasModel())->where('tipo', 3)->findAll(),