app/Controllers/Grupo.php

    public function index()
    {
        $grupoModel = new \App\Models\GrupoModel();

        $convocatoriaSeleccionada = $this->request->getGet('convocatoria') ?? 'AGO25-DIC25'; // o la que uses


        $aspirantesSinGrupo = $this->obtenerAspirantesSinGrupoNivelacion($convocatoriaSeleccionada);

        $sedeModel = new \App\Models\SedesModel(); // Ajusta el nombre si tu modelo tiene otro
        $sedes = $sedeModel->findAll();

        $grupos = $grupoModel->findAll();

        foreach ($grupos as &$grupo) {
            $aspiranteModelTemp = new \App\Models\AspiranteModel();
            $grupo['asignados'] = $aspiranteModelTemp
                ->where('grupo_nivelacion', $grupo['nombre'])
                ->countAllResults();
        }

            $data=[
        'titulo'     => 'Documentación',
            'miga'       => 'Aspirante',
            'url_miga'   => base_url('aspirante/documentacion'),
            'sub_miga'   => 'documentacion',
            'user_info'  => datos_usuario(),
            'grupos' => $grupos,
            'sedes'  => $sedes,
            'aulas' => (new \App\Models\AulasModel())->findAll(),
---
SELECT *
FROM `sedes`
SELECT *
FROM `grupos`
SELECT COUNT(*) AS `numrows`
FROM `aspirantes`
WHERE `grupo_nivelacion` = 'ISC'
SELECT *
FROM `aulas`