app/Controllers/GruposExamen.php

SELECT `aspirantes`.`sede` AS `sede_id`, `aspirantes`.`carrera` AS `carrera_id`, `sedes`.`nombre_sede`, `carreras`.`nombre` AS `nombre_carrera`, COUNT(*) AS total
FROM `aspirantes`
JOIN `sedes` ON `sedes`.`id_sede` = `aspirantes`.`sede`
JOIN `carreras` ON `carreras`.`id` = `aspirantes`.`carrera`
LEFT JOIN `aspirante_grupo_examen` ON `aspirante_grupo_examen`.`curp` = `aspirantes`.`curp`
WHERE `aspirante_grupo_examen`.`grupo_id` IS NULL
AND `aspirantes`.`periodo` = 'AGO25-DIC25'
AND `aspirantes`.`preficha` = 1
GROUP BY `aspirantes`.`sede`, `aspirantes`.`carrera`
SELECT `grupos_examen`.*, `sedes`.`nombre_sede`, `carreras`.`nombre` as `nombre_carrera`, `aulas`.`nombre` as `nombre_aula`
FROM `grupos_examen`
JOIN `sedes` ON `sedes`.`id_sede` = `grupos_examen`.`sede_id`
JOIN `carreras` ON `carreras`.`id` = `grupos_examen`.`carrera_id`
JOIN `aulas` ON `aulas`.`id` = `grupos_examen`.`aula_id`
ORDER BY `fecha` ASC
---
    public function index()
{
    if (!auth()->loggedIn() || !in_array(auth()->user()->nivel, [0, 1])) {
        return redirect()->to(site_url('Acceso/login'))->with('error', 'No tienes permiso para acceder.');
    }

    $convocatoriaSeleccionada = $this->request->getGet('convocatoria');
    $aspirantesSinGrupo = [];

    if ($convocatoriaSeleccionada) {
    $aspiranteModel = new \App\Models\AspiranteModel();
    $db = \Config\Database::connect();

    $aspirantesSinGrupo = $db->table('aspirantes')
    ->select('aspirantes.sede AS sede_id, aspirantes.carrera AS carrera_id, sedes.nombre_sede, carreras.nombre AS nombre_carrera, COUNT(*) AS total')
    ->join('sedes', 'sedes.id_sede = aspirantes.sede')
    ->join('carreras', 'carreras.id = aspirantes.carrera')
    ->join('aspirante_grupo_examen', 'aspirante_grupo_examen.curp = aspirantes.curp', 'left')
    ->where('aspirante_grupo_examen.grupo_id IS NULL') // Solo los que no tienen grupo asignado
    ->where('aspirantes.periodo', $convocatoriaSeleccionada)
    ->where('aspirantes.preficha', 1) // Filtrar solo con preficha = 1
    ->groupBy('aspirantes.sede, aspirantes.carrera')
    ->get()
    ->getResultArray();

}

$grupoModel = new \App\Models\GruposExamenModel();

$grupos = $grupoModel
    ->select('grupos_examen.*, sedes.nombre_sede, carreras.nombre as nombre_carrera, aulas.nombre as nombre_aula')
    ->join('sedes', 'sedes.id_sede = grupos_examen.sede_id')
    ->join('carreras', 'carreras.id = grupos_examen.carrera_id')
    ->join('aulas', 'aulas.id = grupos_examen.aula_id')
    ->orderBy('fecha', 'ASC')
    ->findAll();

SELECT *
FROM `grupos_examen`
SELECT *
FROM `sedes`
SELECT *
FROM `carreras`
SELECT *
FROM `aulas`
SELECT *
FROM `convocatorias`
---
        'url_miga' => base_url('grupos-examen'),
        'sub_miga' => 'grupos-examen',
        'user_info' => datos_usuario(),
        'grupos' => (new \App\Models\GruposExamenModel())->findAll(),
        'sedes' => (new \App\Models\SedesModel())->findAll(),
        'carreras' => (new \App\Models\CarrerasModel())->findAll(),
        'aulas' => (new \App\Models\AulasModel())->findAll(),
        'convocatorias' => (new \App\Models\ConvocatoriaModel())->findAll(),

SELECT *
FROM `grupos_examen`
WHERE `grupos_examen`.`id` = '8'
SELECT `aspirantes`.*, `carreras`.`nombre` AS `nombre_carrera`, `sedes`.`nombre_sede`
FROM `aspirantes`
JOIN `carreras` ON `carreras`.`id` = `aspirantes`.`carrera`
JOIN `sedes` ON `sedes`.`id_sede` = `aspirantes`.`sede`
WHERE `aspirantes`.`carrera` = '35'
AND `aspirantes`.`sede` = '1'
AND `aspirantes`.`preficha` = 1
SELECT `curp`
FROM `aspirante_grupo_examen`
WHERE `grupo_id` = '8'
---
    public function aspirantes($grupo_id)
{
    if (!auth()->loggedIn() || !in_array(auth()->user()->nivel, [0, 1])) {
        return redirect()->to(site_url('Acceso/login'))->with('error', 'No tienes permiso para acceder.');
    }

    $grupoModel = new \App\Models\GruposExamenModel();
    $aspiranteModel = new \App\Models\AspiranteModel();
    $db = \Config\Database::connect();

    $grupo = $grupoModel->find($grupo_id);
    if (!$grupo) {
        return redirect()->back()->with('error', 'Grupo no encontrado.');
    }

    // Buscar aspirantes de la misma sede, carrera y con preficha pagada (preficha = 1)
    $aspirantes = $aspiranteModel
        ->select('aspirantes.*, carreras.nombre AS nombre_carrera, sedes.nombre_sede')
        ->join('carreras', 'carreras.id = aspirantes.carrera')
        ->join('sedes', 'sedes.id_sede = aspirantes.sede')
        ->where('aspirantes.carrera', $grupo['carrera_id'])
        ->where('aspirantes.sede', $grupo['sede_id'])
        ->where('aspirantes.preficha', 1) // ✅ SOLO PAGADOS
        ->findAll();

    // Obtener los CURP ya asignados a este grupo
    $asignados = $db->table('aspirante_grupo_examen')
        ->select('curp')
        ->where('grupo_id', $grupo_id)
        ->get()
        ->getResultArray();

DELETE FROM `aspirante_grupo_examen`
WHERE `curp` = 'S1CTSGZQHERFYFRWAR'
AND `grupo_id` = '8'
---
public function eliminarAspirante($grupo_id = null, $curp = null)
{
    if (!auth()->loggedIn() || !in_array(auth()->user()->nivel, [0, 1])) {
        return redirect()->to(site_url('Acceso/login'))->with('error', 'No autorizado.');
    }

    if (!$curp || !$grupo_id) {
        return redirect()->back()->with('error', 'Datos incompletos.');
    }

    $db = \Config\Database::connect();
    $db->table('aspirante_grupo_examen')
        ->where('curp', $curp)
        ->where('grupo_id', $grupo_id)
        ->delete();