app/Controllers/Grupo.php

SELECT `aspirantes`.`sede` AS `sede_id`, `aspirantes`.`carrera` AS `carrera_id`, `sedes`.`nombre_sede`, `carreras`.`nombre` AS `nombre_carrera`, COUNT(*) AS total
FROM `aspirantes`
JOIN `sedes` ON `sedes`.`id_sede` = `aspirantes`.`sede`
JOIN `carreras` ON `carreras`.`id` = `aspirantes`.`carrera`
LEFT JOIN `aspirante_grupo_examen` ON `aspirante_grupo_examen`.`curp` = `aspirantes`.`curp`
WHERE `aspirante_grupo_examen`.`grupo_id` IS NULL
AND `aspirantes`.`periodo` = 'AGO25-DIC25'
AND `aspirantes`.`preficha` = 1
AND `aspirantes`.`examen` = 1
GROUP BY `aspirantes`.`sede`, `aspirantes`.`carrera`
---
    public function obtenerAspirantesSinGrupoNivelacion($convocatoria)
    {
        $model = new \App\Models\AspiranteModel();

        return $model->select('aspirantes.sede AS sede_id, aspirantes.carrera AS carrera_id, sedes.nombre_sede, carreras.nombre AS nombre_carrera, COUNT(*) AS total')
            ->join('sedes', 'sedes.id_sede = aspirantes.sede')
            ->join('carreras', 'carreras.id = aspirantes.carrera')
            ->where('aspirantes.grupo_nivelacion IS NULL')
            ->where('aspirantes.periodo', $convocatoria)
            ->where('aspirantes.preficha', 1)
            ->where('aspirantes.examen', 1)
            ->where('aspirantes.pago_curso', 1)

            ->groupBy('aspirantes.sede, aspirantes.carrera')
            ->findAll(); // <- Esto devuelve todos los grupos