app/Controllers/Preficha.php

    public function index()
    {
        if (!auth()->loggedIn()) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'Debes iniciar sesión.');
        }

        $user = auth()->user();
        if (!in_array($user->nivel, [0, 1])) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'No tienes permiso para acceder a esta sección.');
        }

        $fecha = $this->request->getGet('fecha');
        $aspirantes = [];

        if ($fecha) {
            $prefichasModel = new \App\Models\PrefichasModel();
            $aspiranteModel = new \App\Models\AspiranteModel();
            $sedeModel = new \App\Models\SedesModel();
            $carreraModel = new \App\Models\CarrerasModel();

            // Obtiene las prefichas para la fecha seleccionada
            $prefichas = $prefichasModel->where('fecha', $fecha)->findAll();

            foreach ($prefichas as $preficha) {
                $aspirante = $aspiranteModel->where('curp', $preficha['curp'])->first();
                if ($aspirante) {
                    $aspirante['sede_nombre'] = $sedeModel->where('id_sede', $preficha['sede_id'])->first()['nombre_sede'] ?? '';
                    $aspirante['carrera_nombre'] = $carreraModel->where('id', $preficha['carrera_id'])->first()['nombre'] ?? '';
---
SELECT *
FROM `aspirantes`
WHERE `curp` = 'AUCY021231HOCQHHA0'
 LIMIT 1
SELECT *
FROM `sedes`
WHERE `id_sede` = '1'
 LIMIT 1
SELECT *
FROM `carreras`
WHERE `id` = '41'
 LIMIT 1

        $aspiranteModel = new \App\Models\AspiranteModel();

        // 1. Obtener todos los aspirantes de la convocatoria (ajusta el filtro si tienes campo de convocatoria)
        $aspirantesConvocatoria = $aspiranteModel->findAll();
---
SELECT *
FROM `aspirantes`