app/Controllers/Preficha.php

SELECT `sede`, `carrera`, COUNT(*) as total
FROM `aspirantes`
GROUP BY `sede`, `carrera`
ORDER BY `sede`
---
public function vistaEntregaDocumentacion()
{
    if (auth()->loggedIn()) {
        $user = auth()->user();

        if (!in_array($user->nivel, [0, 1])) {
            return redirect()->to(site_url('Acceso/login'))->with('error', 'No tienes permiso para acceder a esta sección.');
        }
        $fechaLimite = '2025-07-15';
        $hoy = date('Y-m-d');

        if ($hoy > $fechaLimite) {
            return view('base/publico/no_habilitado', ['mensaje' => 'La asignación de fechas se habilitará después del ' . date('d/m/Y', strtotime($fechaLimite))]);
        }

        $aspiranteModel = new AspiranteModel();

        // Agrupar por sede y carrera
        $grupos = $aspiranteModel->select('sede, carrera, COUNT(*) as total')
            ->groupBy('sede, carrera')
            ->orderBy('sede')
            ->findAll();