app/Controllers/Sedes.php

SELECT *
FROM `sedes`
---
    public function getSedes() {
        $sedeModel = new SedesModel();
        $sedes = $sedeModel->findAll(); // Obtiene todas las sedes

SELECT `carreras`.`id`, `carreras`.`nombre`
FROM `carreras_sedes`
JOIN `carreras` ON `carreras`.`id` = `carreras_sedes`.`id_carrera`
WHERE `id_sede` = '1'
---
    public function getCarrerasPorSede($id_sede) {
        $builder = db_connect()->table('carreras_sedes');
        $carreras = $builder
            ->join('carreras', 'carreras.id = carreras_sedes.id_carrera')
            ->where('id_sede', $id_sede)
            ->select('carreras.id, carreras.nombre')
            ->get()
            ->getResultArray();