app/Models/ConvocatoriaModel.php

public function obtenerConvocatoriaActiva()
{
    $hoy = date('Y-m-d');
    return $this->where('registro_inicio <=', $hoy)
                ->where('registro_fin >=', $hoy)
                ->first();
---
SELECT *
FROM `convocatorias`
WHERE `registro_inicio` <= '2025-08-04'
AND `registro_fin` >= '2025-08-04'
 LIMIT 1